//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="ステップ %d / %d を実行中: エンティティストアを構築しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="ステップ %d / %d を実行中: ブートストラップデータベースを作成しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="ステップ %d / %d を実行中: 要求キューデータベースを作成しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="ステップ %d / %d を実行中: エンティティストアをダウンロードしています (%s / %s 受信完了)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="ステップ %d / %d を実行中: 期限切れの要求を消去しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="ステップ %d / %d を実行中: メタデータをロードしています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="ステップ %d / %d を実行中: 要求キューのマージを実行しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="ステップ %d / %d を実行中: トランザクションマージを実行しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="ステップ %d / %d を実行中: create delete merge を実行しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="ステップ %d / %d を実行中: 定義クエリ %s を処理しています (%s を使用)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="ステップ %d / %d を実行中: 要求を処理しています。変更要求 %s / %s を送信しています。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="ステップ %d / %d を実行中: 変更を再適用しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="ステップ %d / %d を実行中: 受信したデータを分析しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="ステップ %d / %d を実行中: データをサーバから受信しています (%s 受信完了)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="ステップ %d / %d を実行中: 削除された関係を削除しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="ステップ %d / %d を実行中: RemoveAfterUpload に指定された要求を削除しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="ステップ %d / %d を実行中: データをサーバに送信しています (%s 送信完了)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="ステップ %d / %d を実行中: エンティティストアデータベースを送信しています (%s / %s 送信完了)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="ステップ %d / %d を実行中: 要求キューデータベースを送信しています (%s / %s 送信完了)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="ステップ %d / %d を実行中: サーバとの通信を開始しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="ステップ %d / %d を実行中: アップロード前に要求を前処理しています";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="ステップ %d / %d を実行中: ダウンロードを待機しています";

